{
    "I want to apply for US student visa. I have I-20 form and bank balance of $30,000. ": "Eligibility: YES\nReason: The applicant has provided the required documents for a student visa, including an I-20 form and a bank balance of $30,000, which meets the financial requirements for funding their stay in the US.\nMissing Documents: NONE\nCitations: policy_information.txt, us_visa_process_2025.txt",
    "i want visit us for tourism for 3 weeks.i have passport, return ticket and hotel booking but i don't financial sponser.am i eligible": "Eligibility: NO\nReason: The applicant is missing financial documents, which are required for a tourist visa (B1/B2) as they need to show ties to their home country and prove that they can financially support their stay.\nMissing Documents: financial documents\nCitations: policy information, required documents for the us visa process",
    "i got a job offer in us with H-1B sponsorship.i do not have degree certifications yet but i have experience.am i eligible for H-1B visa": "Eligibility: YES\nReason: You have a job offer in the US with H-1B sponsorship, which meets the requirements for a work visa (H1b) as per the policy information.\nMissing Documents: NONE\nCitations: US Visa Process 2025 for all nationalities, Work Visa (H1b, L1, O1)",
    "i want to apply for canada study visa.i have asmission letter and CAD 11,000 funds,passport.i have not yet done biometrics.am i Eligible": "Eligibility: NO\nReason: The user has not yet completed the biometrics step, which is required within 30 days from the date of the biometric instruction letter (BIL). \nMissing Documents: NONE\nCitations: 2. biometrics application fees",
    "i have invitation letter from my brothe and return ticket, but I have only CAD 4,000 funds.Am i eligible for canada visitior visa": "Eligibility: YES\nReason: You have provided an invitation letter from your brother and a return ticket, which meets the requirements for a visitor visa. Although you have only CAD 4,000 funds, the policy does not specify a minimum amount of funds required for a visitor visa.\nMissing Documents: NONE\nCitations: visitor visa policy",
    "i want uk tourist visa for 1 week.i have passport,bank balance of £2500 and hotel booking but no return flight ticket yet.Am i elligible": "Eligibility: NO\nReason: The applicant does not have a return flight ticket yet, which is a required document for a UK tourist visa application.\nMissing Documents: Return flight ticket\nCitations: UK visa application for tourists",
    "i have CAS letter and tuition fee deposit paid but maintenance funds are only £7500 for 28 days.am i eligible for UK student visa": "Eligibility: NO\nReason: The applicant has not met the financial requirements for the student visa, as the maintenance funds of £7500 are only for 28 days, which is less than the required amount for the course duration.\nMissing Documents: NONE\nCitations: UK_Visa_Application_for_Students, UK_Visa_Application_Process",
    "my purpose is tourism.i have CAD 1000.Will my visa get approved according to rules": "Eligibility: YES\nReason: The user's purpose is tourism, which aligns with the visitor visa type. They also have CAD 1000, which is sufficient proof of funds for a visitor visa.\nMissing Documents: NONE\nCitations: policy_information.txt, visa_type_purpose_duration_key_requirement.txt",
    "i want to apply for US F1 visa.I got admission and i have SEVIS receipt and bank funds of $28,000.My TOEFL score is 83 and I will take biometrics next mont.Am I Eligible": "Eligibility: YES\nReason: The user has provided the necessary documents for an F1 visa, including an admission letter, SEVIS receipt, and bank funds of $28,000, which meets the requirements for a student visa.\nMissing Documents: NONE\nCitations: Student Visa (F1/M1) policy extract",
    "i want US B2 Visitor visa to attend my sister's graduation.I have invitation letter,job letter from my employer, return ticket and $12,000 savings but i didn't file taxes last year.am i eligible": "Eligibility: NO\nReason: The applicant did not provide evidence of filing taxes last year, which is a requirement for proving financial support for their stay in the US.\nMissing Documents: NONE\nCitations: tourist visa (b1/b2)",
    "I want US work visa (H1B).I have 4 years of IT experience, job offer and passport, but I do't have degree certificates yet.Will my Visa get approved": "Eligibility: NO\nReason: The applicant does not have a degree certificate, which is a requirement for the H1B work visa.\nMissing Documents: Degree certificates\nCitations: None",
    "I want to travel to germany for 15 days. I have hotel bookings, return ticket, and £2200 funds, but I don't have travel insurance yet.": "Eligibility: NO\nReason: The applicant does not have travel insurance, which is an essential requirement for obtaining a Schengen visa.\nMissing Documents: Travel Insurance\nCitations: 10. Travel insurance",
    "I have admission and blocked account of £11500, but my APS certificate is still in process.Will I get Schengen Visa": "Eligibility: NO\nReason: The applicant's APS certificate is still in process, which is a required document for the Schengen Visa application.\nMissing Documents: APS certificate\nCitations: NONE",
    "I completed IELTS and have funds of £13000. I want to apply for Europe Student Visa.Am i eligible": "Eligibility: NO\nReason: The policy information provided is for the UK visa application, but the user wants to apply for a Europe Student Visa. The policy information does not match the user's requirements.\nMissing Documents: NONE\nCitations: UK_Visa_Application_for_Students, UK_Visa_Application_for_Work_Permits",
    "I want to apply for Schengen business visa to visit Germany for client meeting.I have invitation letter andtravel insurance but only £2100 funds.Will My visa get approved": "Eligibility: NO\nReason: The applicant has only £2100 funds, which is less than the required amount for a Schengen visa. According to the policy, the applicant needs to provide evidence of sufficient financial means to support their stay in the Schengen area.\nMissing Documents: NONE\nCitations: NONE",
    "I am attending a business exhibition in France for 9 days.I have return ticket but my company will not cover daily allowance.Am I eligible": "Eligibility: NO\nReason: The policy information provided does not match the scenario. The policy information seems to be related to Canada work visa for Indian citizens, whereas the scenario is about attending a business exhibition in France for 9 days. The required documents for a Schengen visa are not mentioned in the provided policy information.\nMissing Documents: NONE\nCitations: transport, travel insurance, day-by-day itinerary, requirements for salaried traveller, requirements for self-employed business owners, requirements for student, requirements for international mobility program, requirements for open work permit, proof of funds, medical examinations, police clearance certificates, requirements for salaried traveller, requirements for self-employed business owners, requirements for student, requirements for international mobility program, requirements for open work permit, proof of funds, medical examinations, police clearance certificates",
    "I want Schengen Business visa.I have business registration, meeting confimation and £5200 funds but no travel insurance.Can I apply": "Eligibility: NO\nReason: The applicant is missing travel insurance, which is an essential requirement for obtaining a Schengen visa.\nMissing Documents: travel insurance\nCitations: 10. travel insurance",
    "I want ireland business visa to meet a client for 6 days.I have passport and invitation letter but no return flight ticket yet.Will I be eligible": "Eligibility: NO\nReason: The applicant is planning to stay in Ireland for 6 days, which is less than 90 days, but they do not have a return flight ticket, which is a key requirement for a short stay visa.\nMissing Documents: Return flight ticket\nCitations: Policy Information, Step 1: Determine the correct visa type",
    "I want Ireland Startup Enterpreneur programme Visa.I have £50000 investment funds but my business plan is not validated by an Irish incubator yet.Can I Still apply": "Eligibility: NO\nReason: The Ireland Startup Entrepreneur programme Visa requires a validated business plan by an Irish incubator, which is not mentioned in the provided policy extracts.\nMissing Documents: NONE\nCitations: None",
    "We are two partners oprning a branch office in Ireland.We business registrations and capital but no proof of business turnover.Will the visa get approved": "Eligibility: NO\nReason: The policy extracts provided do not mention any specific requirements for business registration and capital for a long-stay visa application. However, it does mention that a business visa requires a job offer letter detailing terms of employment, employment permit, qualifications and experience documents. Since the user input does not provide any proof of business turnover, it is likely that the visa application will be rejected.\nMissing Documents: \n- Proof of business turnover\nCitations: \n- Policy Information: Work visas: employment permit. job offer letter detailing terms of employment. qualifications and experience documents.",
    "I want to attend a business training workshop in Ireland.I have HR letter and itinerary and professional qualification certificates.Am I eligible": "Eligibility: NO\nReason: The provided information does not specify the duration of stay, but based on the policy information, it seems that the user is applying for a short stay visa. However, the policy information does not mention any specific requirements for a business training workshop, which might be considered a short-term corporate activity. Nevertheless, the policy information does not explicitly state that a business training workshop is eligible for a short stay visa.\nMissing Documents: NONE\nCitations: Section 6 of the original guide, Section 7 of the original guide",
    "Our team of 4 is applying for Schengen Business visa.We have accomadation and itinerary but all funds are in company account, not personal.Will this eligibility": "Eligibility: NO\nReason: The applicant's funds are in a company account, not personal, which does not meet the policy requirement of providing personal bank statements for the last 3 months, stamped and signed (not older than one week).\nMissing Documents: NONE\nCitations: policy information",
    "I an an enterpreneur planning to attend a trade expo in canada.I have passport, travel itinerary and CAD 6000 funds and my company is newly registeres . Am i eligible": "Eligibility: NO\nReason: The policy information does not mention anything about entrepreneurs being eligible for an open work permit or any other type of visa for attending a trade expo in Canada. The information provided is mostly about the requirements and eligibility for different types of visas and permits, but it does not directly address the scenario of an entrepreneur attending a trade expo.\nMissing Documents: NONE\nCitations: None",
    "I want Canada Business visitor visa to explore.I have invitation letter, funds of CAD 9000 and hotl booking.Will they approve": "Eligibility: YES\nReason: The user has provided an invitation letter, funds of CAD 9000, and hotel booking, which are required for a Canada Business visitor visa. The user's intention to explore Canada as a business visitor is also clear.\nMissing Documents: NONE\nCitations: policy_information, latest_facts_news"
}
