{
    "i want to apply for US student visa.I have I-20 form and bank balance of $30000.Am I eligible": "Eligibility: YES\nConfidence Score: 1.0\nReason: The policy extract indicates that for a student visa (F1/M1), applicants need an acceptance letter from a U.S. institution, a valid I-20 or DS-2019 form, and evidence of funds to cover tuition and living expenses. Since you have an I-20 form and a bank balance of $30000, you meet the requirements.\nMissing Documents: NONE\nCitations: policy_extract_1, policy_extract_2",
    "I want US student Visa.I have I- 20 form and bank balance of $30000.I haven't given Biometrics yet.Am i eligible.": "Eligibility: NO\nConfidence Score: 0.8\nReason: The user has not completed the DS-160 form (non-immigrant) or DS-260 (immigrant) form, which is mandatory for initiating the process. Additionally, the user has not scheduled a biometrics appointment, which is required for the visa application process.\nMissing Documents: \n- Completed DS-160 (non-immigrant) or DS-260 (immigrant) form\n- Appointment confirmation page for biometrics\nCitations: policy_information.txt",
    "I want to visit US for tourism for 3 weeks.I have passport,travle itinerery,return ticket and hotel booking but I don't have financial sponsor.Am i eligible": "Eligibility: NO\nConfidence Score: 0.8\nReason: The user does not have financial documents to prove they can fund their stay in the US, which is a requirement for tourist visas (B1/B2).\nMissing Documents: financial documents\nCitations: policy information, required documents for the us visa process",
    "I want US tourist visa.I have passport ,return ticket and hotel booking.Am i eligible": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy does not explicitly state any requirements for tourist visas (B1/B2) other than showing ties to your home country and being able to financially support your stay. You have provided a passport, return ticket, and hotel booking, which suggests you have ties to your home country and can financially support your stay.\nMissing Documents: NONE\nCitations: tourist visa (b1/b2): you must show ties to your home country, such as employment, family, or property, and prove that you can financially support your stay.",
    "I got a job offer in US with H1-B sponsorship.Am I eligible": "Eligibility: YES\nConfidence Score: 1.0\nReason: The policy extract clearly states that applicants must have a job offer from a U.S.-based employer and meet educational or professional qualifications specific to their role for a work visa (h1b, l1, o1).\nMissing Documents: NONE\nCitations: policy_information",
    "I got job offer in US withH1- B sponsorship .I do not Have degree certificates yet but have experience.": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy extract indicates that applicants for work visas (H1-B) must have a job offer from a U.S.-based employer and meet educational or professional qualifications specific to their role. Although the user does not have degree certificates yet, they have experience, which is not explicitly mentioned in the policy extract as a requirement. However, the policy does not explicitly state that experience is not sufficient for H1-B sponsorship.\nMissing Documents: NONE\nCitations: policy_information",
    "I want Canada Study visa.I have admission letter and CAD 10000 and passport.I have not yet done biometrics.": "Eligibility: YES\nConfidence Score: 0.8\nReason: The user has provided an admission letter, CAD 10000, and a passport, which are required documents for a Canada Study visa. However, the user has not yet done biometrics, but this is not a requirement for the initial application.\nMissing Documents: NONE\nCitations: policy_1, policy_2",
    "I have invitation letter from my brother and return ticket,but i have CAD 5000 funds.Am i eligible for Canada visa": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy does not explicitly mention any reasons for rejection based on the provided information. The user has an invitation letter from their brother, a return ticket, and CAD 5000 funds, which meets the requirements for a visitor visa. However, the policy does mention the importance of providing strong financial proof, which the user has done.\nMissing Documents: NONE\nCitations: common_reasons_for_canada_visa_rejection, how_to_avoid_canada_visa_rejection",
    "I want UK tourist visa for 1week.I have passport,bank balance of  £2500 and hotel booking.Am I eligible": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy states that tourists must provide a valid passport, six months of bank statements, travel itinerary, accommodation details, and invitation letters if visiting friends or family. You have provided a passport, bank balance of £2500, and hotel booking, which meets the requirements for a tourist visa.\nMissing Documents: NONE\nCitations: uk_visa_application_process, uk_visa_application_for_tourists",
    "I have CAS letter and tuition fee deposit paid but maintenance funds are only  £7500for 28 days.": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicant has not met the financial requirements for the student visa, as they only have £7500 for 28 days, which is less than the required maintenance funds.\nMissing Documents: NONE\nCitations: policy_information.txt",
    "My purpose is Tourism.I have CAD 15000 funds.Will my visa get approved": "Eligibility: YES\nConfidence Score: 1.0\nReason: The provided policy extracts do not mention any restrictions or requirements that would prevent a tourist visa application from being approved based on the provided information (purpose of tourism and CAD 15000 funds). \nMissing Documents: NONE\nCitations: policy_1, policy_2, policy_3",
    "I want to apply for US F1 visa.I got admission and I have SEVIS receipt and bank funds of $28000.My TOEFL score is 83 and I will take biometrics next month.Am i eligible": "Eligibility: YES\nConfidence Score: 0.8\nReason: The user has an admission letter, SEVIS receipt, and sufficient bank funds, which are required for an F1 visa. The user also has a TOEFL score, which is not explicitly mentioned in the policy but is a common requirement for F1 visas.\nMissing Documents: NONE\nCitations: policy_information.txt",
    "I want to apply for US B2 visitor visa to attend my sister’s graduation.I have invitation letter,job letter from my employer, return ticket and $12000savings.": "Eligibility: YES\nConfidence Score: 0.8\nReason: The applicant has provided an invitation letter, job letter from their employer, return ticket, and $12000 savings, which meets the requirements for a tourist visa (B1/B2) as they have shown ties to their home country (employment) and can financially support their stay.\nMissing Documents: NONE\nCitations: tourist visa (b1/b2)",
    "I want to apply for US B2 visitor visa to attend my sister’s graduation.I have invitation letter, job letter from my employer, return ticket and and $12,000 savings,but I didn't file taxes last year. Am I eligible?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The applicant has provided an invitation letter, job letter from their employer, return ticket, and $12,000 savings, which meet the requirements for a tourist visa (B1/B2). Although they did not file taxes last year, this is not explicitly mentioned as a requirement in the provided policy extracts.\nMissing Documents: NONE\nCitations: tourist visa (b1/b2)",
    "I want US work visa (H1B). I have 4 years of IT experience, job offer and passport,but I don't have degree certificate yet.": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy states that applicants must meet educational or professional qualifications specific to their role for a work visa (H1B), but it does not explicitly mention that a degree certificate is required. However, it is implied that a degree certificate is necessary for the role, as it is not mentioned as an exception.\nMissing Documents: Degree certificate\nCitations: policy_information.txt",
    "I want to apply for Canada student visa. I have LOA from Toronto College and GIC account of CAD 20,000.My IELTS is 6 overall, but I don’t have medical test yet. ": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicant does not have a medical test yet, which is a mandatory requirement for most work permit applicants and study permits. Although the policy does not explicitly state that a medical test is required for student visas, it is a general requirement for most visa categories.\nMissing Documents: Medical test\nCitations: policy_information.txt",
    "I want to apply for Canada visitor visa for 3 weeks.I have hotel booking, invitation letter and funds of CAD 5,500,but no travel history. Am I eligible?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The applicant has provided hotel booking, invitation letter, and sufficient funds (CAD 5,500) for a 3-week stay in Canada. Although the applicant lacks travel history, this is not a guaranteed rejection reason according to the policy (point 8). The applicant's strong financial proof and ties to India (through the hotel booking and invitation letter) support their eligibility for a visitor visa.\nMissing Documents: NONE\nCitations: \"Canada visa for indians\" policy extracts",
    "I want to apply for Canada PR under Express Entry.I have degree certificate, IELTS 7,3 years work experience and bank funds of CAD 14,000.I'm 34 years old. Am I eligible?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy does not explicitly mention any ineligibility criteria for Express Entry applicants with a degree certificate, IELTS 7, 3 years of work experience, and bank funds of CAD 14,000. However, it does emphasize the importance of strong financial proof and demonstrating a clear intent to return to the home country.\nMissing Documents: NONE\nCitations: policy_information",
    "I want to apply for UK student visa. I have CAS letter and passport, first-year tuition fee paid,but I have maintenance funds only for 20 days instead of 28 days.": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicant has maintenance funds only for 20 days instead of the required 28 days, which does not meet the financial requirements for a student visa.\nMissing Documents: NONE\nCitations: UK_Visa_Application_for_Students, UK_Visa_Application_Process",
    "I want UK tourist visa for 10 days. I have accommodation booking,return ticket,and bank balance of £1800. I am self-employed but  do not have tax returns. Am I eligible?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy information provided does not support the eligibility for a UK tourist visa as the applicant is self-employed but does not have tax returns, which is not explicitly mentioned as a requirement. However, the policy does mention that the applicant must demonstrate strong ties to their home country, which may be a concern in this case.\nMissing Documents: NONE\nCitations: uk_visa_application_for_tourists, uk_visa_application_process",
    "I want UK Skilled Worker Visa. I have job sponsorship certificate and degree,but have not cleared the tuberculosis test. Can my visa be approved?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy states that you must meet certain requirements, including having a tuberculosis test, to qualify for a UK Skilled Worker Visa. Since you have not cleared the tuberculosis test, you do not meet this requirement.\nMissing Documents: NONE\nCitations: Skilled Worker Visa eligibility",
    "I want to travel to Germany for 15 days. I have hotel bookings, return ticket,and €2,200 funds, but I don’t have travel insurance yet. Am I eligible?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicant does not have travel insurance, which is an essential requirement for obtaining a Schengen visa.\nMissing Documents: Travel Insurance\nCitations: policy_10_travel_insurance",
    "I want study visa for Germany. I have admission and blocked account of €11,500,but my APS certificate is still in process. Will my visa be approved?": "Eligibility: NO\nConfidence Score: 0.0\nReason: The policy information provided does not relate to Germany study visa eligibility. It appears to be about UK student visa and Schengen visa requirements for Indians.\nMissing Documents: NONE\nCitations: UK_student_visa, Schengen_visa_requirements_for_Indians",
    "I want to apply for tourism visa to any country. I have passport and return ticket,but I have no financial proof. Can I still get approval?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy requires strong financial proof for a tourism visa application, which is not provided in the user input. The user has a passport and return ticket, but lacks financial documents to demonstrate their ability to support themselves during their stay.\nMissing Documents: recent bank statements, salary slips, income tax returns, evidence of investments\nCitations: how_to_avoid_canada_visa_rejection, schengen_visa_requirements_for_indians",
    "I want to apply for US student visa. I have university acceptance letter,SEVIS receipt, I-20, TOEFL 95, passport, and funds of $31,000. I have no travel history and I haven't completed biometrics yet.Based on official policy, am I eligible or not?": "Eligibility: YES\nConfidence Score: 0.9\nReason: The user has provided all the necessary documents for a student visa application, including a university acceptance letter, SEVIS receipt, I-20, TOEFL 95, passport, and funds of $31,000. The user meets the eligibility criteria for a student visa, which includes having an acceptance letter from a U.S. institution, a valid I-20 or DS-2019 form, and evidence of funds to cover tuition and living expenses.\nMissing Documents: NONE\nCitations: policy_information.txt",
    "We are 4 family members applying for Schengen tourist visa. We have hotel booking and insurance but only €5,000 funds. Will it be approved?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicants have only €5,000 funds, which is less than the required amount for a Schengen tourist visa. According to the policy, the applicants need to demonstrate sufficient funds for their stay in the Schengen area.\nMissing Documents: NONE\nCitations: policy information (funds requirements not explicitly mentioned but implied)",
    "I want to apply for Schengen business visa to visit Germany for client meeting.I have invitation letter and travel insurance but only €2,100 funds. Will it get approved?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicant has only €2,100 funds, which is less than the required amount for a Schengen visa. Although the policy does not explicitly state the required amount, it is implied that the applicant should have sufficient funds for their stay in the Schengen area.\nMissing Documents: NONE\nCitations: policy_information.txt",
    "I am attending a business exhibition in France for 9 days. I have hotel booking and return ticket but my company will not cover daily allowance. Am I still eligible?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy requires a detailed day-by-day itinerary, which is not provided. Additionally, the policy does not explicitly state that daily allowance is not required for business exhibitions, but it does require proof of sufficient funds for the duration of the stay.\nMissing Documents: Detailed day-by-day itinerary\nCitations: policy_1, policy_10",
    "I want to apply for Schengen business visa for Italy to negotiate supplier contract. I have business registration, meeting confirmation and €5,200 funds but no travel insurance. Can I apply?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The applicant is missing travel insurance, which is an essential requirement for obtaining a Schengen visa (Policy 10: Travel insurance).\nMissing Documents: Travel insurance\nCitations: Policy 10: Travel insurance",
    "Our team of 4 is applying for Schengen business visa. We have accommodation and itinerary ": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy information provided indicates that the applicant has accommodation and itinerary, which are required documents for a Schengen business visa. The policy also outlines the steps to apply for a Schengen visa from India, which the applicant has presumably followed.\nMissing Documents: NONE\nCitations: Schengen visa requirements for Indians, Schengen visa application process",
    "I want Ireland Business visa to meet a client for 6 days. I have passport and invitation letter but no return flight ticket yet. Will I be eligible?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy states that a return flight ticket is a key requirement for a short stay C visa, which is the type of visa the user is applying for. Since the user does not have a return flight ticket yet, they do not meet this requirement.\nMissing Documents: Return flight ticket\nCitations: policy information, types of ireland visas for indians",
    "I want Ireland visa. I have €50,000 investment fundsbut my business plan is not validated by an Irish incubator yet. Can I still apply?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy does not explicitly mention that an investment of €50,000 is sufficient for a visa application without a validated business plan by an Irish incubator. However, it does not explicitly state that a validated business plan is required either. The closest information is about the requirements for a work visa, which includes a job offer letter detailing terms of employment, qualifications and experience documents, and an employment permit. Since the policy does not directly address the scenario, the confidence score is 0.8.\nMissing Documents: NONE\nCitations: types_of_ireland_visas_for_indians, application_process_for_irish_visa_for_indians",
    "I want to attend a business training workshop in Ireland. I have HR letter and itinerary but no professional qualification certificates. Am I eligible?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy does not explicitly mention any requirements for attending a business training workshop, but it does mention that a short stay visa is required for stays less than 90 days, and a long stay visa is required for stays more than 90 days. Since the user has no professional qualification certificates, it is likely that they would be applying for a short stay visa, but the policy does not provide any information on the required documents for a business training workshop.\nMissing Documents: professional qualification certificates\nCitations: types_of_ireland_visas_for_indians, policy_information",
    "We are two partners opening a branch office in Ireland. We have business registration and capital but no proof of business turnover. Will the visa get approved?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy requires proof of business turnover for business registration and capital, which is not provided. Although health insurance is mentioned, it is not a requirement for business visas.\nMissing Documents: Proof of business turnover\nCitations: Policy Information",
    "We are two partners opening a branch office in Ireland. We have business registration and capital ": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy does not explicitly mention any requirements for opening a branch office in Ireland. However, it does mention that business registration and capital are required for the application, which is present in the user input.\nMissing Documents: NONE\nCitations: policy_information.txt",
    "I want to attend a startup accelerator event in the US, then travel to UK and Schengen countries for business meetings.I want to attend a startup accelerator event in the US, then travel to UK and Schengen countries for business meetings.": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy does not explicitly mention restrictions on attending startup accelerator events in the US or traveling to UK and Schengen countries for business meetings. However, it does mention that non-immigrant visas (NIV) are for individuals who plan to stay in the US temporarily, and common types include B1/B2 for tourists and business visitors. This suggests that attending a startup accelerator event and traveling for business meetings may fall under the B1/B2 category.\nMissing Documents: NONE\nCitations: us_visa_process_2025_for_all_nationalities_updated_rules_timeline",
    "I am an entrepreneur applying for Canada startup visa and Ireland startup visa. I have one business plan, but no Letters of Support yet. Am I eligible for either?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy does not explicitly state that an entrepreneur with one business plan and no Letters of Support is eligible for a Canada startup visa. However, it does not directly disqualify them either. The closest relevant information is about the importance of strong financial proof and recent bank statements, which is not mentioned in the user input.\nMissing Documents: Letters of Support\nCitations: Canada startup visa",
    "want to apply for a US student visa but I don’t have I-20 yet. Can I still apply?”": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy clearly states that a valid I-20 or DS-2019 form is required for a student visa (F1/M1) application. Since you don't have an I-20 yet, you are not eligible to apply for a US student visa.\nMissing Documents: I-20\nCitations: policy_information.txt",
    "I don’t have a job or bank statements. Can I still get a Schengen visa for tourism?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy does not explicitly state that a job or bank statements are required for a Schengen visa for tourism. However, it does mention that supporting documents relating to the purpose of your stay, evidence of financial means, and accommodation during your stay are required. Since the user does not have a job or bank statements, it is likely that they will not meet the financial means requirement.\nMissing Documents: Job, Bank statements\nCitations: Schengen visa requirements for Indians, How to apply for a Schengen visa from India",
    "I have job experience but no degree certificate. Can I get Canada work visa?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy does not explicitly mention that job experience without a degree certificate is sufficient for a Canada work visa. In fact, it mentions that a Labour Market Impact Assessment (LMIA) is required for most employer-specific work permits, which implies that a degree certificate may be necessary for certain types of work permits.\nMissing Documents: NONE\nCitations: policy_1, policy_2",
    "Can I apply for US B1 business visa with just a conference registration but without employment letter?": "You must evaluate confidence strictly by the amount of supporting evidence in the policy documents:\n\nScoring rules:\n- 0.90–1.00 → requirements fully match policy with strong evidence\n- 0.60–0.89 → mostly supported but one part unclear or missing\n- 0.40–0.59 → partially supported, some major uncertainty\n- 0.20–0.39 → very weak match, important information missing\n- 0.00–0.19 → almost no supporting evidence in the documents\n\nIf the policy documents DO NOT clearly answer the question, confidence MUST be below 0.60\n\nEligibility: NO\nConfidence Score (0.0 to 1.0): 0.00\nReason: The policy documents do not mention any specific requirements for a conference registration to apply for a US B1 business visa without an employment letter. However, it does mention that tourist visa (b1/b2) applicants must show ties to their home country, such as employment, family, or property, and prove that they can financially support their stay.\nMissing Documents: NONE\nCitations: tourist visa (b1/b2)",
    "I’m visiting Germany for training but I only have invitation letter, not accommodation proof. Can I apply?": "You must evaluate confidence strictly by the amount of supporting evidence in the policy documents:\n\nScoring rules:\n- 0.90–1.00 → requirements fully match policy with strong evidence\n- 0.60–0.89 → mostly supported but one part unclear or missing\n- 0.40–0.59 → partially supported, some major uncertainty\n- 0.20–0.39 → very weak match, important information missing\n- 0.00–0.19 → almost no supporting evidence in the documents\n\nIf the policy documents DO NOT clearly answer the question, confidence MUST be below 0.60\n\nEligibility: NO\nConfidence Score (0.0 to 1.0): 0.00\nReason: The policy documents do not mention accommodation proof as a required document for a Schengen visa application for training purposes. However, it does mention that proof of sponsorship or private accommodation is required for sponsored/invited applicants.\nMissing Documents: Accommodation proof\nCitations: Schengen Visa Policy for Indians",
    "Can I apply for Ireland work visa with no employment offer yet?": "Eligibility: NO\nConfidence Score: 0.0\nReason: The policy information provided does not mention anything about applying for an Ireland work visa without an employment offer. In fact, it mentions that a job offer is required for the skilled worker visa, which is one of the work visa categories.\nMissing Documents: NONE\nCitations: uk_visa_application_for_work_permits, skilled_worker_visa_eligibility",
    "I want Canada Business Visitor visa to explore franchise partnership.I have invitation letter, funds of CAD 8,500 and hotel booking but no proof of ties to my home country. Will they approve?": "Eligibility: NO\nConfidence Score: 0.7\nReason: The user lacks proof of ties to their home country, which is a common reason for visa rejection. Although they have an invitation letter, funds, and a hotel booking, these documents do not demonstrate strong ties to India.\nMissing Documents: NONE\nCitations: common reasons for canada visa rejection, how to avoid canada visa rejection",
    "I want Canada Startup Visa. I have pitch deck and strong business idea but no Letter of Support from a designated organization yet. Can I apply?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy documents do not mention any specific requirements for a startup visa, but they do mention that a Letter of Support from a designated organization is required. Since you do not have this document, you do not meet the eligibility criteria.\nMissing Documents: Letter of Support from a designated organization\nCitations: policy extracts",
    "I am an entrepreneur planning to attend a trade expo in Canada. I have passport, travel itinerary and CAD 6,000 fundsbut my company is newly registered and has no tax filing history. Am I eligible?": "Eligibility: NO\nConfidence Score (0.0 to 1.0): 0.0\nReason: The policy extracts do not mention anything about entrepreneurs or trade expo attendees being eligible for open work permits. The provided information focuses on specific programs and situations, such as post-graduation work permits, spouses or common-law partners of skilled workers, and international experience Canada programs.\nMissing Documents: NONE\nCitations: imp, open_work_permit, for_indians, canada_visa",
    "I want to register a new office in Canada. I have capital funds of CAD 160,000.": "Based on the provided policy extracts, I will evaluate your eligibility to register a new office in Canada with CAD 160,000 capital funds.\n\nEligibility: YES\nConfidence Score: 0.8\nReason: The policy extracts do not mention any specific requirements for registering a new office in Canada, nor do they mention any restrictions on capital funds. However, the confidence score is not 1.0 because the policy extracts do not explicitly mention office registration or capital funds.\nMissing Documents: NONE\nCitations: latest_facts_news, work_permits_for_family_members_of_foreign_workers",
    "We are two co-founders applying for the US business visa to attend product expo.We are two co-founders applying for the US business visa to attend product expo.": "Eligibility: NO\nConfidence Score: 0.0\nReason: The policy extracts do not mention anything about US business visa eligibility for co-founders attending a product expo. The provided information is about the US visa process in general, including tourist, student, work, and immigrant visas, but does not specifically address business visa eligibility for co-founders.\nMissing Documents: NONE\nCitations: None",
    "I want to apply for the UK business visitor visa to attend meetings for 12 days. I have invitation letter and hotel but only £1,600 in bank funds. Will the visa be approved?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy documents do not explicitly state the required amount of funds for a business visitor visa. However, it is mentioned that \"you also need to show sufficient funds to support your stay without working\" for tourist visas. Since the applicant has only £1,600, which might not be sufficient for a 12-day stay, the eligibility is likely to be rejected.\nMissing Documents: NONE\nCitations: uk_visa_application_process, uk_visa_application_for_tourists",
    "My company is sending me to the UK for 2-month business training. I have HR letter, sponsorship and salary slip but my TB test is not done yet. Am I eligible?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy documents do not mention anything about business training or temporary worker visas for short-term jobs. However, they do mention the skilled worker visa, which requires a job offer, certificate of sponsorship, proof of salary, and English language proficiency. The provided information about the TB test not being done yet also raises concerns about medical certificates or TB tests being required depending on the country.\nMissing Documents: TB test result\nCitations: skilled_worker_visa, temporary_worker_visas",
    "I want to apply for US Business B1 visa to attend a 10-day tech conference in Silicon Valley.I have invitation letter, hotel booking and passport, my company will sponsor travel. Am I eligible?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy documents mention that applicants for a B1 visa must show ties to their home country, such as employment, family, or property, and prove that they can financially support their stay. The user has provided an invitation letter, hotel booking, and passport, and their company will sponsor travel, which meets these requirements.\nMissing Documents: NONE\nCitations: tourist visa (b1/b2)",
    "I have an I-20 from a SEVP-approved university and a bank balance of $42,000. I paid the SEVIS fee and scheduled my biometrics. Am I eligible for US F1 student visa?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy documents clearly state that for student visas (F1/M1), applicants need an acceptance letter from a U.S. institution, a valid I-20 or DS-2019 form, and evidence of funds to cover tuition and living expenses. You have provided an I-20 from a SEVP-approved university and a bank balance of $42,000, which meets the requirements.\nMissing Documents: NONE\nCitations: policy extracts from \"supporting documents by visa type\" and \"student visa (f1/m1)\"",
    "I booked flights, hotel, insurance, and have €8000 funds for a 10-day stay. Am I eligible for Schengen tourist visa?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The user has provided a round-trip flight reservation, which meets the policy requirement for transportation. Additionally, the user has mentioned having €8000 funds for a 10-day stay, which implies they have sufficient financial means to support themselves during their trip. However, the policy does not explicitly mention the required amount of funds, so this is an assumption based on the provided information.\nMissing Documents: NONE\nCitations: transportation) round-trip flight reservation, 10. travel insurance",
    "I got admission at an Irish university, paid tuition, and have €12,000 financial proof. Am I eligible for Ireland student visa?": "Eligibility: YES\nConfidence Score: 0.8\nReason: The policy documents mention that a study visa requires an admission letter from an Irish university, proof of tuition fees payment, and English language proficiency test results. The user has provided admission at an Irish university, paid tuition, and has €12,000 financial proof, which matches the requirements.\nMissing Documents: NONE\nCitations: Types of Ireland Visas for Indians, Application Process for Irish Visa for Indians",
    "Can I get US tourist visa without any bank statement or job proof?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy documents clearly state that applicants must show ties to their home country, such as employment, family, or property, and prove that they can financially support their stay for tourist visa (B1/B2). Since the question asks about getting a US tourist visa without any bank statement or job proof, it contradicts the policy requirements.\nMissing Documents: bank statement, job proof\nCitations: breakdown by visa category, required documents for the us visa process",
    "Can I get Canada study permit without proof of funds because my uncle will pay when I reach there?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy clearly states that a study permit is mandatory for academic programs exceeding six months in duration at a designated learning institution (dli) in Canada, and requires proof of funds to support yourself throughout your entire stay. However, it does not explicitly state that an exception can be made for a student who has a sponsor in Canada.\nMissing Documents: NONE\nCitations: student visas (study permits) for indian students aspiring to pursue higher education in canada, 3. financial preparedness",
    "I don’t have hotel booking or itinerary. Can I still apply for UK tourist visa?": "Eligibility: NO\nConfidence Score: 0.8\nReason: The policy documents do not explicitly mention that a hotel booking or itinerary is required for a UK tourist visa application. However, they do mention that a travel itinerary is one of the required documents for a tourist visa application. This suggests that a hotel booking or itinerary might be implied as part of the travel plans, but it is not explicitly stated as a requirement.\nMissing Documents: NONE\nCitations: uk visa application for tourists purpose and visa types for tourists",
    "Can I apply for Schengen visa if I have only ₹50,000 and no employment proof?": "Eligibility: NO\nConfidence Score: 0.0\nReason: The policy documents do not mention any specific financial requirements for a Schengen visa, but they do mention the need for \"evidence of financial means\" in the supporting documents. However, the provided information does not specify the minimum amount required. Additionally, the policy does not mention employment proof as a requirement, but it does mention the need for a \"cover letter\" explaining the purpose of the visit, which implies that employment or financial stability may be considered.\nMissing Documents: NONE\nCitations: Schengen Visa Requirements for Indians, How to Apply for a Schengen Visa from India",
    "I received a Letter of Acceptance (LOA) from a Canadian DLI university and proof of GIC + first-year tuition payment. Do I qualify for Canada Study Permit?": "Eligibility: YES\nConfidence Score (0.0 to 1.0): 1.0\nReason: The policy documents mention that a Letter of Acceptance (LOA) from a Canadian DLI university and proof of GIC + first-year tuition payment are required for a Canada Study Permit. These documents are mentioned in the policy information.\nMissing Documents: NONE\nCitations: 1.",
    "Can I apply for UK Skilled Worker visa without a Certificate of Sponsorship (CoS)?": "Eligibility: NO\nConfidence Score: 1.0\nReason: The policy explicitly states that to qualify for a Skilled Worker visa, you must have a job offer listed on the Home Office's eligible occupations list and a Certificate of Sponsorship (CoS) from your employer.\nMissing Documents: NONE\nCitations: Skilled Worker visa eligibility"
}