{"timestamp": 1764159483.1333067, "query": "Am I eligible for an H4 visa if my spouse has an H1B?", "response": "Yes, you are eligible for an H-4 visa as long as your spouse holds a valid H-1B status and you can provide proper marital documentation.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333078, "query": "Am I eligible for an H4 visa if my spouse has an H1B?”, "response": "Based on standard U.S. immigration rules, you qualify for an H4 dependent visa as long as your spouse maintains valid H1B status. You may proceed with the H4 application and required documentation.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333079, "query": “Can I work in the U.S. on an H4 visa?”, "response": "You may work in the U.S. only after obtaining an H4 EAD, which is available if your spouse’s I-140 petition is approved. Without the EAD, employment is not permitted.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333087, "query": "My H1B spouse recently changed employers. Do I need to file a new H4 visa?", "response": "You remain eligible for H4 status, but you must file for an H4 extension or visa stamping update matching your spouse’s new H1B approval. This ensures your dependent status remains valid.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333088, "query": "Is my child eligible for an H4 visa if they are 20 years old?”, "response": Your child is eligible for an H4 visa until they reach 21. After that age, they will need to move to another status such as F1 (student visa).\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333089, "query": "Can I study in the U.S. while on an H4 visa?”, "response": "You are fully eligible to study in the U.S. under H4 status. You do not need to convert to F1 unless you seek visa-linked benefits such as CPT/OPT.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333096, "query": "Can I travel outside the U.S. while my H4 extension is pending?”, "response": "You may travel, but your pending H4 extension will be cancelled. Re-entry is allowed only with a valid H4 visa stamp..\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333097, "query": “Is biometric required for H4 visa stamping?”, "response": Biometrics are mandatory for H4 visa stamping as per current consulate procedures.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333098, "query": "Can I change from H4 to F1 while living in the U.S.?”, "response": You can apply for H4 → F1 change of status and may remain in the U.S. until USCIS decides.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333099, "query": "Can an H4 EAD holder work multiple jobs?", "response": "You may legally work multiple jobs with a valid H4 EAD.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333101, "query": "Is an interview mandatory for H4 visa stamping in India?", "response": "An interview may be waived depending on eligibility, but first-time H4 applicants are usually required to attend."\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333102, "query": “Do I need to submit my spouse’s pay stubs for H4 visa stamping?”, "response": You must provide recent H1B pay stubs to support your H4 visa application.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333103, "query": "Can an H4 EAD holder start a business in the U.S.?", "response": "You are fully eligible to start and run a business with a valid H4 EAD.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333104, "query": "Can I stay in the U.S. if my spouse loses their H1B job?”, "response": You must either file a status change or depart after the H1B spouse’s status ends.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333105, "query": "Is my newborn child eligible for H4 status?", "response": "Your child is eligible for H4 status and may enter the U.S. after visa stamping.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333106, "query": "Can I apply for H4 EAD immediately after my spouse’s I-140 approval?", "response": "You may apply for an H4 EAD as soon as the spouse’s I-140 is approved.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333107, "query": "Do H4 visa holders need to file U.S. taxes?”, "response": You file taxes only if you earn income via EAD; otherwise, you appear as a dependent.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333108, "query": "Can I study on H4 and later apply for CPT/OPT?", "response": "You must switch to F1 if you want CPT/OPT work authorization.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333109, "query": "Can I stay in the U.S. while my H4 EAD renewal is pending?", "response": "You may remain in the U.S., but cannot work until the renewed EAD card arrives.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333110, "query": "Does my H1B spouse need to accompany me for H4 stamping?", "response": "You may attend H4 stamping alone; the H1B spouse’s presence is not required."\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333111, "query": “Can I apply for an H4 visa while living in a third country?”, "response": You may apply for H4 stamping in a third country if you are legally residing there.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333112, "query": "Can I renew my H4 visa without my spouse renewing H1B?", "response": "H4 cannot be extended unless the spouse’s H1B is approved and valid.\n", "docs_used": [{}, {}, {}, {}, {}]}
{"timestamp": 1764159483.1333113, "query": "Do I need a separate H4 visa appointment for each of my children?", "response": "Premium processing is available only if all three applications—H1B, H4, and H4 EAD—are filed together.\n", "docs_used": [{}, {}, {}, {}, {}]}"